# Analisis Exploratorio
    COLUMNAS
    -'role'
    -'salary'
    -'industry'
    -'company size'
    -'people_in_data'

In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import sidetable as stb
from sklearn.preprocessing import OneHotEncoder

In [5]:
df = pd.read_csv("/mnt/c/Users/USUARIO/Desktop/Adalab/project-da-promo-A-module-2-team-1-/Limpieza de documentos/preparadito.csv", index_col= 0)

verificamos que los index esten bien.

In [19]:
df.head(3)

,survey_number,age,gender,country,education_level,programming_experience,programming_language,primary_bd_tool,years_ml,ml_frameworks,ml_algorithms,role,salary,industry,company size,people_in_data,gender_2
0,910,50-54,Man,India,Bachelor’s degree,5-10 years,"Python, R","Local development environments (RStudio, Jupyt...",5-10 years,"Scikit-learn , TensorFlow ,Caret","Linear or Logistic Regression, Decision Trees ...",Other,"25,000-29,999",Manufacturing/Fabrication,NaN,3-4,Man
1,784,50-54,Man,Indonesia,Master’s degree,20+ years,"SQL, C, C++, Java","Advanced statistical software (SPSS, SAS, etc.)",< 1 year,Scikit-learn,"Linear or Logistic Regression, Decision Trees ...",Program/Project Manager,"60,000-69,999",Manufacturing/Fabrication,NaN,1-2,Man
2,924,22-24,Man,Pakistan,Master’s degree,1-3 years,"Python, C++, Java","Basic statistical software (Microsoft Excel, G...",I do not use machine learning methods,NaN,NaN,Software Engineer,$0-999,Academics/Education,NaN,0,Man

In [6]:
df.tail(3)

,survey_number,age,gender,country,education_level,programming_experience,programming_language,primary_bd_tool,years_ml,ml_frameworks,ml_algorithms,role,salary,industry,company size,people_in_data,gender_2
25970,494,50-54,Man,Sweden,Doctoral degree,I have never written code,NaN,"Basic statistical software (Microsoft Excel, G...",NaN,NaN,NaN,Research Scientist,$0-999,Academics/Education,NaN,20+,Man
25971,277,45-49,Man,United States of America,Master’s degree,5-10 years,"Python, SQL",NaN,4-5 years,Scikit-learn,"Linear or Logistic Regression, Decision Trees ...",Data Scientist,NaN,Online Service/Internet-based Services,NaN,20+,Man
25972,255,18-21,Man,India,Bachelor’s degree,I have never written code,NaN,"Advanced statistical software (SPSS, SAS, etc.)",NaN,NaN,NaN,Business Analyst,$0-999,Other,NaN,0,Man

In [7]:
df.shape

(25973, 17)

Analizamos que tipo de datos tenemos

In [11]:
df.dtypes

survey_number               int64
age                        object
gender                     object
country                    object
education_level            object
programming_experience     object
programming_language       object
primary_bd_tool            object
years_ml                   object
ml_frameworks              object
ml_algorithms              object
role                       object
salary                     object
industry                   object
company size              float64
people_in_data             object
gender_2                   object
dtype: object

In [9]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
survey_number,25973.0,11054.664921,101471.622125,120.0,443.0,656.0,1038.0,2488653.0
company size,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [10]:
df.describe(include = ['O']).T

,count,unique,top,freq
age,25973,11,25-29,4931
gender,25973,5,Man,20598
country,25973,66,India,7434
education_level,25973,7,Master’s degree,10132
programming_experience,25973,7,1-3 years,7874
programming_language,24941,825,Python,4740
primary_bd_tool,18489,6,"Basic statistical software (Microsoft Excel, G...",7246
years_ml,23754,9,< 1 year,9163
ml_frameworks,19624,1401,Scikit-learn,2688
ml_algorithms,19315,756,"Linear or Logistic Regression, Decision Trees ...",1807
role,25973,15,Student,6804
salary,15391,26,$0-999,3369
industry,16325,18,Computers/Technology,4079
people_in_data,16126,7,1-2,3642
gender_2,25973,3,Man,20598

Revisamos los nulos que tenemos

In [13]:
df.isnull().sum()

survey_number                 0
age                           0
gender                        0
country                       0
education_level               0
programming_experience        0
programming_language       1032
primary_bd_tool            7484
years_ml                   2219
ml_frameworks              6349
ml_algorithms              6658
role                          0
salary                    10582
industry                   9648
company size              25973
people_in_data             9847
gender_2                      0
dtype: int64

Revisar duplicados

In [25]:
df.duplicated().sum()

1

    Hay una duplicada tenemos que encontrarla y eliminarla

Revisar valores únicos

In [15]:
df.role.unique()

array(['Other', 'Program/Project Manager', 'Software Engineer',
       'Research Scientist', 'Currently not employed', 'Student',
       'Data Scientist', 'Data Analyst', 'Machine Learning Engineer',
       'Business Analyst', 'Data Engineer', 'Product Manager',
       'Statistician', 'Developer Relations/Advocacy',
       'DBA/Database Engineer'], dtype=object)

    Role no tiene nulos ni errores en valores únicos. No necesitamos hacer cambios

In [16]:
df.salary.unique()

array(['25,000-29,999', '60,000-69,999', '$0-999', '30,000-39,999', nan,
       '15,000-19,999', '70,000-79,999', '2,000-2,999', '10,000-14,999',
       '5,000-7,499', '20,000-24,999', '1,000-1,999', '100,000-124,999',
       '7,500-9,999', '4,000-4,999', '40,000-49,999', '50,000-59,999',
       '3,000-3,999', '300,000-499,999', '200,000-249,999',
       '125,000-149,999', '250,000-299,999', '80,000-89,999',
       '90,000-99,999', '150,000-199,999', '>$1,000,000',
       '$500,000-999,999'], dtype=object)

In [18]:
df.salary.value_counts()

$0-999              3369
1,000-1,999          969
10,000-14,999        950
30,000-39,999        741
100,000-124,999      725
5,000-7,499          699
50,000-59,999        697
40,000-49,999        688
20,000-24,999        587
2,000-2,999          575
15,000-19,999        573
7,500-9,999          552
60,000-69,999        551
25,000-29,999        470
70,000-79,999        464
4,000-4,999          456
150,000-199,999      392
80,000-89,999        391
3,000-3,999          380
125,000-149,999      379
90,000-99,999        350
200,000-249,999      177
300,000-499,999       91
250,000-299,999       75
>$1,000,000           58
$500,000-999,999      32
Name: salary, dtype: int64

    SALARIO
    El tipo es object creo que porque son rangos de número esto no se si deba cambiar.
    Los datos estan en intervalos.
    unos datos tienen el signo pesos
    unos datos tienen simbolos como mayor y menor que

In [21]:
df.industry.value_counts()

Computers/Technology                      4079
Academics/Education                       3214
Accounting/Finance                        1459
Other                                     1136
Manufacturing/Fabrication                  872
Medical/Pharmaceutical                     776
Government/Public Service                  726
Online Service/Internet-based Services     585
Energy/Mining                              558
Retail/Sales                               536
Insurance/Risk Assessment                  424
Marketing/CRM                              373
Broadcasting/Communications                326
Shipping/Transportation                    316
Non-profit/Service                         300
Online Business/Internet-based Sales       275
Military/Security/Defense                  197
Hospitality/Entertainment/Sports           173
Name: industry, dtype: int64

In [22]:
df["company size"].unique()

array([nan])

    Company size 
    Esta mal escrita(le falta el _ )
    Solo tiene valores nulos, revisar el archivo original de donde venia esta columna... no se si al hacer merge se pudo dañar.
    Propongo eliminar la columna

In [23]:
df.people_in_data.unique()

array(['3-4', '1-2', '0', '5-9', nan, '10-14', '20+', '15-19'],
      dtype=object)

    People in data
    - Es tipo object
    - Son rango de números
    - Tiene nulos
    - Tiene el signo +